0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 -0.2 0);

boundaryField
{
     lowerWall
    {
        type            noSlip;
    }
    lowerWall1
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }
    lowerWall2
    {

        type            fixedValue;//pressureInletOutletVelocity;
        value           uniform (0 50 0);
    }
    rightWall
    {
        type            noSlip;
    }
   leftWall
    {
        type            noSlip;
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform (0 -0.2 0);
    }
    /*
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    */
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
