constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       13830;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       13930;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       14030;
    }
    lowerWall2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       14050;
    }
    lowerWall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       14070;
    }
    atmosphere
    {
        type            patch;
        nFaces          70;
        startFace       14100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14000;
        startFace       14170;
    }
)

// ************************************************************************* //
