system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0) //0
    (0.2159 0 0)//n1
    (0.2159 10 0)//n2
    (0 10 0) //n3
  
    (0 0 0.1) //n4
    (0.2159 0 0.1)//n5
    (0.2159 10 0.1)//n6
    (0 10 0.1) //n7

    (0.4826 0 0)//n8
    (0.4826 10 0) //n9
    
    (0.4826 0 0.1)//n10
    (0.4826 10 0.1) //n11

     (2.032 0 0) //n12
     (2.032 10 0) //n13

     (2.032 0 0.1) //n14
     (2.032 10 0.1)//n15

     (2.2987 0 0) //n16
     (2.2987 10 0)//n17
  
     (2.2987 0 0.1)//n18
     (2.2987 10 0.1)//n19

     (2.5146 0 0) //n20
     (2.5146 10 0) //n21

     (2.5146 0 0.1) //n22
     (2.5146 10 0.1) //n23


);

blocks
(
 hex (0 1 2 3 4 5 6 7) (10 100 1) simpleGrading (1 1 1)
 hex (1 8 9 2 5 10 11 6) (10 100 1) simpleGrading (1 1 1)
 hex (8 12 13 9 10 14 15 11) (30 100 1) simpleGrading (1 1 1)
 hex (12 16 17 13 14 18 19 15) (10 100 1) simpleGrading (1 1 1)
 hex (16 20 21 17 18 22 23 19) (10 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
           (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
             (20 22 23 21)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
        (1 5 10 8)
        (12 14 18 16)
        );
    }
    lowerWall2
    {
        type wall;
        faces
        (
        (0 4 5 1)
        (16 18 22 20)

        );
    }
    lowerWall1
    {
        type wall;
        faces
        (
            (8 10 14 12)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
        (3 7 6 2)
        (2 6 11 9)
        (9 11 15 13)
        (13 15 19 17)
        (19 17 21 23)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
